
players = [
    {
    "name":"Лиза",
    "armor": 0.95,
    "hp": 100,
    "attack": 21,
    "luck": 10,
    "money": 100000,
    "sword": 20,
    "inventory": [],
    },
    {
    "name": "Ксюша",
    "armor": 0.95,
    "hp": 100,
    "attack": 15,
    "luck": 10,
    "money": 100000,
    "sword": 20,
    "inventory": []
    },
    {
    "name": "Нелля",
    "armor": 0.95,
    "hp": 110,
    "attack": 20,
    "luck": 15,
    "money": 1000000,
    "sword": 30,
    "inventory": []
    },
    {
    "name": "Денчик",
    "armor": 0.95,
    "hp": 150,
    "attack": 40,
    "luck": 45,
    "money": 600000,
    "sword": 70,
    "inventory": []
    },
    {
    "name": "Илиль",
    "armor": 0.95,
    "hp": 135,
    "attack": 38,
    "luck": 42,
    "money": 600000,
    "sword": 50,
    "inventory": []
    },
    {
    "name": "Антон",
    "armor": 0.95,
    "hp": 25,
    "attack": 10,
    "luck": 92,
    "money": 10000000,
    "sword": 60,
    "inventory": []
    },
    {
    "name": "Максим",
    "armor": 0.95,
    "hp": 165,
    "attack": 165,
    "luck": 65,
    "money": 650000,
    "sword": 65,
    "inventory": []
    },
]

enemies = [
    {
        "name": "Злое Зомби Брауни",
        "hp": 50,
        "attack": 20,
        "script": "ЫЫЫЫ, мозги путника!",
        "win": "Мы еще сразимся с тобой! Я еще съем твои мозги, идиот! ЫЫЫЫЫЫЫЫЫ!",
        "lose": "ХА-ХА, я так и знал. Лузер.",
    },
    {
        "name": "Булочка",
        "hp": 15,
        "attack": 15,
        "script": "Попробуй сразиться со мной путник!",
        "win": "Мы еще сразимся с тобой!",
        "lose": "ХА-ХА, я так и знал. Лузер.",
    },
    {
        "name": "Привидешка",
        "hp": 150,
        "attack": 15,
        "script": "Попробуй сразиться со мной путник!",
        "win": "Мы еще сразимся с тобой!",
        "lose": "ХА-ХА, я так и знал. Лузер.",
    },
    {
        "name": "Ужас на крыльях ночи",
        "hp": 15,
        "attack": 14,
        "script": "Попробуй сразиться со мной путник!",
        "win": "Мы еще сразимся с тобой!",
        "lose": "ХА-ХА, я так и знал. Лузер.",
    },
    {
        "name": "Булочный демон",
        "hp": 5000,
        "attack": 50,
        "script": "Попробуй сразиться со мной путник!",
        "win": "Мы еще сразимся с тобой!",
        "lose": "ХА-ХА, я так и знал. Лузер.",
    }
]

items = {
    "1": {"name": "Зелье удачи", "price": 1500},
    "2": {"name": "Пропуск тренировки", "price": 1000},
    "3": {"name": "Меч дракона", "price": 5000},
    "4": {"name": "Великий меч", "price": 20000},
    "5": {"name": "Выход", "price": 1},
}